Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties
Serialization structure for AnalysisPartCompositeProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties._CompositeBeamType
The composite beam type.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties._CompositeBeamSlabMaterial
The composite beam slab material.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties._CompositeBeamSlabThickness
The composite beam slab thickness.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties._CompositeBeamWidthModeLeft
The composite beam width left.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties._CompositeBeamWidthLeft
The composite beam width left.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties._CompositeBeamWidthModeRight
The composite beam width right.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties._CompositeBeamWidthRight
The composite beam width right.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties._CompositeBeamWidthFromSpanFactor
The composite beam width right from span factor.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties.ToStruct(Tekla.Structures.Analysis.AnalysisPartCompositeProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPartCompositeProperties.FromStruct(Tekla.Structures.Analysis.AnalysisPartCompositeProperties)
DO NOT USE! For internal usage only!
P: P.